Revit 2027 API
ParameterTypeId.StructuralConnectionNobleStatus Property
 "Noble Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralConnectionNobleStatus { get; }
Public Shared ReadOnly Property StructuralConnectionNobleStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralConnectionNobleStatus {
	ForgeTypeId^ get ();
}
static member StructuralConnectionNobleStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace